import React from "react";
import styles from "./policy-text.module.css";

const policyText = [
  {
    title: "1. ОБЩИЕ ПОЛОЖЕНИЯ",
    text: [
      "1.1. В рамках настоящей Политики под персональной информацией Пользователя понимаются:",
      "1.1.1. Персональная информация, которую Пользователь предоставляет о себе самостоятельно при регистрации (создании учетной записи) или в процессе использования Сервисов, включая персональные данные Пользователя. Обязательная для предоставления Сервисов информация помечена специальным образом. Иная информация предоставляется Пользователем на его усмотрение. ",
      "1.1.2. Данные, которые автоматически передаются сервисам Сайта в процессе их использования с помощью установленного на устройстве Пользователя программного обеспечения, в том числе IP-адрес, данные файлов cookie, информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к сервисам), технические характеристики оборудования и программного обеспечения, используемых Пользователем, дата и время доступа к сервисам, адреса запрашиваемых страниц и иная подобная информация.",
      "1.1.3. Иная информация о Пользователе, обработка которой предусмотрена Соглашением об использовании Сайта.",
      "1.1.4. Настоящая Политика конфиденциальности применяется только к Сайту https://www.анталиядом.com. Сайт https://www.анталиядом.com не контролирует и не несет ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте https://www.анталиядом.com",
    ],
  },
  {
    title: "2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ",
    text: [
      "2.1. Администрация сайта собирает и хранит только ту персональную информацию, которая необходима для указанных ниже целей, а также исполнения соглашений и договоров с Пользователем, за исключением случаев, когда законодательством предусмотрено обязательное хранение персональной информации в течение определенного законом срока.",
      "2.2. Персональную информацию Пользователя сайта Администрация сайта обрабатывает в следующих целях:",
      "2.2.1. Связь с Пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования сайта https://www.анталиядом.com, исполнения соглашений и договоров, а также обработка запросов и заявок от Пользователя;",
      "2.2.2. Улучшение качества сайта https://www.анталиядом.com, удобства его использования, разработка новых продуктов;",
      "2.2.3. Таргетирование рекламных материалов;",
      "2.2.4. Проведение статистических и иных исследований на основе обезличенных данных.",
      "2.2.5. Для осуществления прав и законных интересов Администрации сайта и/или третьих лиц",
    ],
  },
  {
    title: "3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ И ЕЕ ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ",
    text: [
      "3.1. Сайт хранит персональную информацию Пользователей в соответствии с внутренними регламентами конкретных сервисов.",
      "3.2. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления Пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании отдельных сервисов Пользователь соглашается с тем, что определенная часть его персональной информации становится общедоступной.",
      "3.3. Сайт вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:",
      "3.3.1. Пользователь выразил согласие на такие действия.",
      "3.3.2. Передача необходима для использования Пользователем определенного сервиса либо для исполнения определенного соглашения или договора с Пользователем.",
      "3.3.4. Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры.",
      "3.3.5. В случае продажи Сайта к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации.",
      '3.4. Обработка персональных данных Пользователя осуществляется без ограничения срока любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств. Обработка персональных данных Пользователей осуществляется в соответствии с Федеральным законом от 27.07.2006 N 152-ФЗ "О персональных данных".',
      "3.5. При утрате или разглашении персональных данных Администрация Сайта информирует Пользователя об утрате или разглашении персональных данных.",
      "3.6. Администрация Сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.",
      "3.7. Администрация Сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.",
    ],
  },
  {
    title: "4. ОБЯЗАТЕЛЬСТВА СТОРОН",
    text: [
      "4.1. Пользователь обязан:",
      "4.1.1. Предоставить достоверную информацию о персональных данных, необходимую для пользования Сайтом.",
      "4.2. Администрация Сайта обязана:",
      "4.2.1. Использовать полученную информацию исключительно для целей, указанных в настоящей Политике конфиденциальности.",
      "4.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением предусмотренных настоящей Политикой конфиденциальности.",
      "4.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемому для защиты такого рода информации в существующем деловом обороте.",
      "4.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки в случае выявления недостоверных персональных данных или неправомерных действий.",
    ],
  },
  {
    title: "5. ОТВЕТСТВЕННОСТЬ СТОРОН",
    text: [
      "5.1. Администрация Сайта, не исполнившая свои обязательства, несет ответственность за убытки, понесенные Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации.",
      "5.2. В случае утраты или разглашения конфиденциальной информации Администрация Сайта не несет ответственности, если данная конфиденциальная информация:",
      "5.2.1. Стала публичным достоянием до ее утраты или разглашения.",
      "5.2.2. Была получена от третьей стороны до момента ее получения Администрацией Сайта.",
      "5.2.3. Была разглашена с согласия Пользователя.",
    ],
  },
  {
    title: "6. РАЗРЕШЕНИЕ СПОРОВ",
    text: [
      "6.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Сайта и Администрацией Сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).",
      "6.2. Получатель претензии в течение 10 календарных дней со дня получения претензии письменно уведомляет заявителя претензии о результатах рассмотрения претензии.",
      "6.3. При недостижении соглашения спор будет передан на рассмотрение в суд в соответствии с действующим законодательством Российской Федерации.",
      "6.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией Сайта применяется действующее законодательство Российской Федерации.",
    ],
  },
  {
    title: "7. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ",
    text: [
      "7.1. Администрация Сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.",
      "7.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности. Действующая Политика конфиденциальности размещена на странице по адресу: https://www.анталиядом.com",
      "7.3. Настоящая Политика конфиденциальности является неотъемлемой частью Соглашения об использовании Сайта, размещенного на странице по адресу: https://www.анталиядом.com",
    ],
  },
];

const PolicyText = () => {
  return (
    <div className={styles.policy}>
      <h1 className={styles.policyTitle}>Политика конфиденциальности и условия использования сервиса </h1>
      <span className={styles.policyText}>
        Настоящий документ «Политика конфиденциальности» (далее – по тексту – «Политика») представляет собой правила
        использования Администрацией сайта персональной информации Пользователя, предоставляемой им при использовании
        сайта, расположенного по адресу: https://www.анталиядом.com/ Использование сервисов Сайта означает
        безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки его
        персональной информации; в случае несогласия с этими условиями Пользователь должен воздержаться от использования
        сервисов.
      </span>
      {policyText.map((item, i) => (
        <div key={i} className={styles.policyBlock}>
          <h1 className={styles.policyBlockTitle}>{item.title}</h1>
          <ul>
            {item.text.map((text, i) => (
              <li key={i}>{text}</li>
            ))}
          </ul>
        </div>
      ))}
    </div>
  );
};

export default PolicyText;
